<!DOCTYPE html>
<html>
<head>
	<link rel="stylesheet" type="text/css" href="stylee.css">
	<title>logo</title>
</head>
<body>
	<div class="logo">
		<div class="div">
		<img src="images.jpeg" alt="Smiley face" height="57" width="700">
		<div class="div1">
			<h1>093 ** ** **</h1>
			<h2>077 ** ** **</h2>
		</div>
		<?php include_once "header.php";?>
		<div class="div10">
			
			</div>

		  </div>
		  		<div class="div12">
			<img src="download.png" class="img3">
			<h1>style.css</h1>
			<p>CSS
CSS-shade.svg

Ընդլայնում	.css[1]
MIME	text/css
Մշակող	CSS Working Group
Հրատարակված է	դեկտեմբերի 17, 1996
Ֆորմատի տեսակ	ոճային լեզու
Կայք	w3.org/Style/CSS/ և drafts.csswg.org
Cascading Style Sheets Վիքիպահեստում
CSS կամ կասկադային ոճաթերթ (Cascading Style Sheets - կասկադային ոճերի թերթներ), կայքին ձևավորում տալու համար օգտագործվող տեխնոլոգիա ծրագրավորման ֆորմալ լեզվով։ CSS-ը հիմնականում օգտագործվում է HTML և XHTML ֆորմատի պատկանող վեբ-էջերի ձևավորման համար, սակայն կարող է նաև օգտագործվել ցանկացած տեսակի XML ֆորմատի փաստաթղթերի համար, ներառյալ SVG և XUL, ինչպես նաև դիզայնի, մակետի, տարբեր սարքերի և տարբեր էկրանների վրա ներկայացնելու համար։

Երբ HTML 3.2 -ի սպեցիֆիկացիայի մեջ ավելացվեցին -ի նման թեգերը, գույնի ատրիբուտները։ Խոշոր վեբ-կայքերի նախագծումը դարձավ երկար և ծախսատար գործընթաց, քանի որ ամեն էջի վրա պետք է նշվեր շրիֆտը և գունային ինֆորմացիան։ Այս խնդիրը լուծելու համար World Wide Web (W3C) կոնսորցիումը ստեղծեց CSS-ը։ CSS-ը HTML-ի էջից հանեց ոճային ֆորմատավորումը[2]։.</p>
			<h1 class="h42">Նկարագրություն</h1>
			<p>CSS-ը օգտագործվում է վեբ-էջեր նախագծողների կողմից գույներ, տառատեսակներ, գտնվելու վայր և այլ նկարագրություններ տալու համար։ CSS-ի հիմնական նպատակն է առանձնացնել HTML էջի պարունակությունը և նրա նկարագրությունը, դրանով իսկ էջին հաղորդել մատչելիություն, ճկունություն և նրա նկարագրությունը կառավարելու հնարավորություն, ինչպես նաև նվազեցնել հրամանների կրկնությունը և բարդությունը։ Բացի այդ CSS-ը թույլ է տալիս տվյալ դոկումենտը ներկայացնել տարբեր ոճերով։ Էջի արտածման ժամանակ CSS-ը կարող է վերցվել տարբեր աղբյուրներից։

Եթե ոճերի աղյուսակը գրված է առանձին ֆայլի մեջ, ապա այն կարող է միանալ վեբ փաստաթղթին` հղումով (անգլ.՝ link), որը փաստաթղթի մեջ տեղադրվում է <head> և </head> զույգ թեգերի մեջ: <link> թեգը պետք է ունենա href ատրիբուտը, որն էլ նշում է ոճերի աղյուսակի հասցեն: Այդ աղյուսակում նշված բոլոր հատկությունները տարածվում են ամբողջ փաստաթղթի վրա: Գրելաձևը հետևյալն է.</p>
			</div>
		</div>

	</div>

</body>
</html>